garyPenhook/PyAvrOCD/svd/avr32sd32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPR</name>
      <description>General Purpose Registers</description>
      <baseAddress>0x0080001C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPR0</name>
          <description>General Purpose Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR1</name>
          <description>General Purpose Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR2</name>
          <description>General Purpose Register 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR3</name>
          <description>General Purpose Register 3</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCK</name>
      <description>Lockbits</description>
      <baseAddress>0x00801040</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEY</name>
          <description>Lock Key Bits</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Lock Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>No Description.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>1556464988</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MVIO</name>
      <description>Multi-Voltage I/O</description>
      <baseAddress>0x00800100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VDDIO2IE</name>
              <description>VDDIO2 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VDDIO2IF</name>
              <description>VDDIO2 Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VDDIO2S</name>
              <description>VDDIO2 Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMCTRL</name>
      <description>Non-volatile Memory Controller</description>
      <baseAddress>0x00801000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x12</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDR</name>
          <description>Address</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCMD</name>
                  <description>No Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>No Operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLWR</name>
                  <description>Flash Write</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLPER</name>
                  <description>Flash Page Erase</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER2</name>
                  <description>Flash Multi-Page Erase 2 pages</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER4</name>
                  <description>Flash Multi-Page Erase 4 pages</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER8</name>
                  <description>Flash Multi-Page Erase 8 pages</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER16</name>
                  <description>Flash Multi-Page Erase 16 pages</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER32</name>
                  <description>Flash Multi-Page Erase 32 pages</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEWR</name>
                  <description>EEPROM Write</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERWR</name>
                  <description>EEPROM Erase and Write</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEBER</name>
                  <description>EEPROM Byte Erase</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEMBER2</name>
                  <description>EEPROM Multi-Byte Erase 2 bytes</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEMBER4</name>
                  <description>EEPROM Multi-Byte Erase 4 bytes</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEMBER8</name>
                  <description>EEPROM Multi-Byte Erase 8 bytes</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEMBER16</name>
                  <description>EEPROM Multi-Byte Erase 16 bytes</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEMBER32</name>
                  <description>EEPROM Multi-Byte Erase 32 bytes</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHER</name>
                  <description>Chip Erase Command</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EECHER</name>
                  <description>EEPROM Erase Command</description>
                  <value>48</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APPCODEWP</name>
              <description>Application Code Write Protect</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTRP</name>
              <description>Boot Read Protect</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APPDATAWP</name>
              <description>Application Data Write Protect</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEWP</name>
              <description>EEPROM Write Protect</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLMAP</name>
              <description>Flash Mapping in Data space</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTION0</name>
                  <description>Flash section 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION1</name>
                  <description>Flash section 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION2</name>
                  <description>Flash section 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION3</name>
                  <description>Flash section 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLMAPLOCK</name>
              <description>Flash Mapping Lock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UROWWP</name>
              <description>User Row Write Protect</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTROWWP</name>
              <description>Boot Row Write Protect</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCALL1</name>
              <description>Erased Flash ECC check</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHECKALL</name>
                  <description>ECC check on all flash words including those read as all-ones.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISALL</name>
                  <description>Disregard ECC check on flash words read as all-ones from the entire flash.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISAPPDATA</name>
                  <description>Disregard ECC check on flash words read as all-ones from from the APPDATA section or USER row</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISAPPDATAEE</name>
                  <description>Disregard ECC check on EEPROM bytes read as all-ones, and flash words read as all-ones from the APPDATA section, USER row, or BOOTROW</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ECC1</name>
              <description>1-bit ECC error inject</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC2</name>
              <description>2-bit ECC error inject</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYI</name>
              <description>Parity error inject on Instruction Fetch</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYD</name>
              <description>Parity error inject on Data Read</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>ECC comparator error inject</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Data</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>4294967295</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTCTRLA</name>
          <description>Interrupt Control A</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEREADY</name>
              <description>EEPROM Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGSA</name>
          <description>Interrupt Flags A</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEREADY</name>
              <description>EEPROM Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGSB</name>
          <description>Interrupt Flags B</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FECC1</name>
              <description>Flash 1-bit ECC error detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FECC2</name>
              <description>Flash multibit error detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EECC1</name>
              <description>EEPROM 1-bit error detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EECC2</name>
              <description>EEPROM multibit error detected</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYC</name>
              <description>Parity error on Control signals detected</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYA</name>
              <description>Parity error on Address detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITYD</name>
              <description>Parity error on Write Data detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Comparator error detected</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARITY</name>
          <description>ECC Parity</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEBUSY</name>
              <description>EEPROM busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FBUSY</name>
              <description>Flash busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Write error</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALIDCMD</name>
                  <description>Write command not selected or not valid</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITEPROTECT</name>
                  <description>Write to section not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDCOLLISION</name>
                  <description>Selecting new write command while programming is ongoing</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNDROME</name>
          <description>ECC Syndrome</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
